{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMpoX0HWF3S85z5NllFqduV"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"FRxk0DevxHun","executionInfo":{"status":"ok","timestamp":1671873844970,"user_tz":-180,"elapsed":7176,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"4688f279-deb1-41c5-a157-718dae4c2436"},"outputs":[{"output_type":"stream","name":"stdout","text":["Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/\n","Collecting rdflib\n","  Downloading rdflib-6.2.0-py3-none-any.whl (500 kB)\n","\u001b[K     |████████████████████████████████| 500 kB 3.9 MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.8/dist-packages (from rdflib) (3.0.9)\n","Collecting isodate\n","  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n","\u001b[K     |████████████████████████████████| 41 kB 569 kB/s \n","\u001b[?25hRequirement already satisfied: setuptools in /usr/local/lib/python3.8/dist-packages (from rdflib) (57.4.0)\n","Requirement already satisfied: six in /usr/local/lib/python3.8/dist-packages (from isodate->rdflib) (1.15.0)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.1 rdflib-6.2.0\n"]}],"source":["!pip install rdflib"]},{"cell_type":"code","source":["from google.colab import drive\n","\n","from rdflib import Graph, Literal, BNode, Namespace, URIRef\n","from rdflib.namespace import XSD, RDF, OWL, RDFS, VOID\n","\n","drive.mount('/content/gdrive')\n","\n","ontology_url = 'gdrive/My Drive/Colab Notebooks/OntologiesRepresentationKnowledge/filled-tanks-ontology.owl'"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"YN4VZ8H_xbnx","executionInfo":{"status":"ok","timestamp":1671879417434,"user_tz":-180,"elapsed":21675,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"48ab80de-ea0c-4343-a190-4087b5a92a39"},"execution_count":10,"outputs":[{"output_type":"stream","name":"stdout","text":["Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount(\"/content/gdrive\", force_remount=True).\n"]}]},{"cell_type":"code","source":["# Create a Graph\n","tanks_ontology_graph = Graph()\n","\n","# Parse in an RDF file\n","tanks_ontology_graph.parse(ontology_url, format=\"turtle\")\n","\n","print(len(tanks_ontology_graph))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"yqaMujV-x62m","executionInfo":{"status":"ok","timestamp":1671879906357,"user_tz":-180,"elapsed":411596,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"a36b31af-a17e-475c-b0bc-41d17208ebdc"},"execution_count":12,"outputs":[{"output_type":"stream","name":"stdout","text":["4595028\n"]}]},{"cell_type":"code","source":["# 1. Сколько игроков в бою превысили свои средние показатели по урону на используемом танке?\n","player_success_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT (COUNT(?player) as ?superiorPlayers) WHERE {\n","    ?battleResults a :BattleResults .\n","    ?battleResults :isResultsOfPlayer ?player .\n","    ?battleResults :playedOn ?tank .\n","    ?battleResults :batResDamage ?damageInBattle .\n","    ?playerStatOnTank :tankStatisticOf ?player .\n","    ?playerStatOnTank :tankStatisticOn ?tank .\n","    ?playerStatOnTank :concreteTankDamageDealt ?damageDealt .\n","    ?playerStatOnTank :concreteTankBattles ?battlesOnTank .\n","    FILTER (xsd:float(?damageInBattle) > ?damageDealt/?battlesOnTank)\n","  }\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(player_success_query):\n","    print(f\"{row.superiorPlayers} of players surpassed themselves\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ysDvAk5FEazl","executionInfo":{"status":"ok","timestamp":1671889310144,"user_tz":-180,"elapsed":418,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"98d5b735-4770-4ecc-ed51-204c57761021"},"execution_count":33,"outputs":[{"output_type":"stream","name":"stdout","text":["85 of players surpassed themselves\n"]}]},{"cell_type":"code","source":["# 2. Какой из танков, представленных в бою, имеется у наибольшего числа игроков в статистике?"],"metadata":{"id":"ajMul1HBEdwY"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["# 3. Какой самый популярный тип техники по сумме сыгранных боёв среди игроков?"],"metadata":{"id":"1Rz4JvfKEgHm"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["# 4. Тяжелые танки какой нации наименее результативны?"],"metadata":{"id":"muUgISAtEjyR"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["# 5. Кто повалил больше всего деревьев в среднем за бой?\n","max_treesCut_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT ?name (xsd:float(?treesCut)/xsd:float(?battlesCount) AS ?result) WHERE {\n","    ?player a :Player .\n","    ?player :nickName ?name .\n","    ?player :hasStatistic ?statistic .\n","    ?statistic :treesCut ?treesCut .\n","    ?statistic :battles ?battlesCount .\n","  }\n","  ORDER BY DESC(?result)\n","  LIMIT 1\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(max_treesCut_query):\n","    print(f\"{row.name} avg_cuts {row.result}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PouRAgW70Vu8","executionInfo":{"status":"ok","timestamp":1671884752976,"user_tz":-180,"elapsed":414,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"c899c50b-b91e-4905-8226-8bcd06f1bfb0"},"execution_count":13,"outputs":[{"output_type":"stream","name":"stdout","text":["15_MunyT_ADA avg_cuts 3.426887094707164\n"]}]}]}